src = [
    ('Ацидофилин 1%'                        , 3        , 1       , 4       , 40),
    ('Ацидофилин 3,2%'                      , 2.9      , 3.2     , 3.8     , 59),
    ('Ацидофилин 3,2% сладкий'              , 2.8      , 3.2     , 8.6     , 77),
    ('Ацидофилин нежирный'                  , 3        , 0.05    , 3.9     , 31),
    ('Брынза (из коровьего молока)'         , 22.1     , 19.2    , 0.4     , 262),
    ('Варенец 2,5%'                         , 2.9      , 2.5     , 4.1     , 53),
    ('Запеканка из обезжиренного творога'   , 17.6     , 4.2     , 14.2    , 168),
    ('Йогурт 1,5%'                          , 4.1      , 1.5     , 5.9     , 57),
    ('Йогурт 1,5% плодово-ягодный'          , 4        , 1.5     , 14.3    , 90),
    ('Йогурт 3,2%'                          , 5        , 3.2     , 3.5     , 68),
    ('Йогурт 3,2% сладкий'                  , 5        , 3.2     , 8.5     , 87),
    ('Йогурт 6%'                            , 5        , 6       , 3.5     , 92),
    ('Йогурт 6% сладкий'                    , 5        , 6       , 8.5     , 112),
    ('Кефир 1%'                             , 3        , 1       , 4       , 40),
    ('Кефир 2,5%'                           , 2.9      , 2.5     , 4       , 53),
    ('Кефир 3,2%'                           , 2.9      , 3.2     , 4       , 59),
    ('Кефир нежирный'                       , 3        , 0.05    , 4       , 31),
    ('Кумыс (из кобыльего молока)'          , 2.1      , 1.9     , 5       , 50),
    ('Кумыс нежирный (из коровьего молока)' , 3        , 0.05    , 6.3     , 41),
    ('Масса творожная 16,5% жирности'       , 12       , 16.5    , 9.5     , 232),
    ('Молоко 1,5%'                          , 3        , 1.5     , 4.8     , 45),
    ('Молоко 2,5%'                          , 2.9      , 2.5     , 4.8     , 54),
    ('Молоко 3,2%'                          , 2.9      , 3.2     , 4.7     , 60),
    ('Молоко 3,5%'                          , 2.9      , 3.5     , 4.7     , 62),
    ('Молоко козье'                         , 3.6      , 4.1     , 4.5     , 69),
    ('Молоко нежирное'                      , 3        , 0.05    , 4.9     , 32),
    ('Молоко сгущённое с сахаром 5%'        , 7.1      , 5       , 55.2    , 295),
    ('Молоко сгущённое с сахаром 8,5%'      , 7.2      , 8.5     , 55.5    , 328),
    ('Молоко сгущённое с сахаром нежирное'  , 7.5      , 0.2     , 56.8    , 259),
    ('Молоко сухое 15%'                     , 28.5     , 15      , 44.7    , 432),
    ('Молоко сухое 25%'                     , 24.2     , 25      , 39.3    , 483),
    ('Молоко сухое нежирное'                , 33.2     , 1       , 52.6    , 362),
    ('Мороженое пломбир'                    , 3.7      , 15      , 20.4    , 232),
    ('Мороженое сливочное'                  , 3.3      , 10      , 19.4    , 183),
    ('Пахта'                                , 3.3      , 1       , 4.7     , 41),
    ('Простокваша 1%'                       , 3        , 1       , 4.1     , 40),
    ('Простокваша 2,5%'                     , 2.9      , 2.5     , 4.1     , 53),
    ('Простокваша 3,2%'                     , 2.9      , 3.2     , 4.1     , 59),
    ('Простокваша нежирная'                 , 3        , 0.05    , 3.8     , 30),
    ('Ряженка 1%'                           , 3        , 1       , 4.2     , 40),
    ('Ряженка 2,5%'                         , 2.9      , 2.5     , 4.2     , 54),
    ('Ряженка 4%'                           , 2.8      , 4       , 4.2     , 67),
    ('Ряженка 6%'                           , 3        , 6       , 4.1     , 85),
    ('Сливки 10%'                           , 2.7      , 10      , 4.5     , 119),
    ('Сливки 20%'                           , 2.5      , 20      , 4       , 207),
    ('Сливки 25%'                           , 2.4      , 25      , 3.9     , 251),
    ('Сливки 35%'                           , 2.2      , 35      , 3.2     , 337),
    ('Сливки 8%'                            , 2.8      , 8       , 4.5     , 102),
    ('Сливки сгущённые с сахаром 19%'       , 8        , 19      , 47      , 392),
    ('Сливки сухие 42%'                     , 19       , 42      , 30.2    , 577),
    ('Сметана 10%'                          , 2.7      , 10      , 3.9     , 119),
    ('Сметана 15%'                          , 2.6      , 15      , 3.6     , 162),
    ('Сметана 20%'                          , 2.5      , 20      , 3.4     , 206),
    ('Сметана 25%'                          , 2.4      , 25      , 3.2     , 250),
    ('Сметана 30%'                          , 2.3      , 30      , 3.1     , 293),
    ('Сыр "Адыгейский"'                     , 19.8     , 19.8    , 1.5     , 264),
    ('Сыр "Голландский" 45%'                , 26.3     , 26.6    , 0       , 350),
    ('Сыр "Камамбер"'                       , 15.3     , 28.8    , 0.1     , 324),
    ('Сыр "Пармезан"'                       , 35.7     , 25.8    , 0.8     , 392),
    ('Сыр "Пошехонский" 45%'                , 26       , 26.1    , 0       , 344),
    ('Сыр "Рокфор" 50%'                     , 20.5     , 27.5    , 0       , 335),
    ('Сыр "Российский" 50%'                 , 23.2     , 29.5    , 0       , 364),
    ('Сыр "Сулугуни"'                       , 20.5     , 22      , 0.4     , 286),
    ('Сыр "Фета"'                           , 14.2     , 21.3    , 4.1     , 264),
    ('Сыр "Чеддер" 50%'                     , 23.5     , 30.8    , 0       , 380),
    ('Сыр "Швейцарский" 50%'                , 24.6     , 31.6    , 0       , 391),
    ('Сыр Гауда'                            , 24.9     , 27.4    , 2.2     , 356),
    ('Сыр нежирный'                         , 18       , 0.6     , 1.5     , 86),
    ('Сыр плавленый "Колбасный"'            , 21.2     , 19.4    , 3.7     , 275),
    ('Сыр плавленый "Российский"'           , 20.5     , 23      , 2.5     , 300),
    ('Сырки глазированные 27,7% жирности'   , 7.9      , 27.7    , 32.6    , 413),
    ('Сырники из обезжиренного творога'     , 18.6     , 3.6     , 18.2    , 183),
    ('Творог 11%'                           , 16       , 11      , 3       , 178),
    ('Творог 18% (жирный)'                  , 15       , 18      , 2.8     , 236),
    ('Творог 2%'                            , 20       , 2       , 3       , 114),
    ('Творог 4%'                            , 21       , 4       , 3       , 136),
    ('Творог 5%'                            , 21       , 5       , 3       , 145),
    ('Творог 9% (полужирный)'               , 18       , 9       , 3       , 169),
    ('Творог нежирный'                      , 22       , 0.6     , 3.3     , 110),
]

from main.models import AdvUser
from main.models import Product
fazacz = AdvUser.objects.get(username='fazacz')
desc = 'http://frs24.ru/st/tablica-kalorijnosti-produktov-pitaniya/'
for line in src:
    Product.objects.create(author=fazacz, name=line[0], protein=line[1], fat=line[2], carbohydrate=line[3], energy_value=line[4], description=desc)






Product.objects.create(author=fazacz, name='Блюдо1', protein=1, fat=2, carbohydrate=3, energy_value=44, description=desc)
Meal.objects.create(author=fazacz, name='Блюдо1', protein=1, fat=2, carbohydrate=3, energy_value=44, description=desc)
p1 = Product.objects.get(pk=1)
p2 = Product.objects.get(pk=2)
por1 = Portion.objects.create(dish=p1, component=p2, amount=77)


